In [5]:
import pandas as pd
dados = pd.read_csv('C:/Users/Andre/Documents/DidaticaTech/nike_sales.csv')

In [6]:
dados.head()

,Month,Region,Main_Category,Sub_Category,Product_Line,Price_Tier,Units_Sold,Revenue_USD,Online_Sales_Percentage,Retail_Price
0,November,India,Equipment,Bags,Gym Sack,Budget,48356,14506800,73,300
1,January,India,Equipment,Accessories,Hats,Budget,9842,2066820,50,210
2,October,India,Apparel,Tops,Tech Fleece,Mid-Range,25079,1755530,90,70
3,December,Greater China,Footwear,Cricket,Vapor Cricket,Premium,41404,8694840,58,210
4,May,Greater China,Equipment,Socks,Performance Socks,Premium,33569,5371040,53,160

In [7]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Month                    1000 non-null   object
 1   Region                   1000 non-null   object
 2   Main_Category            1000 non-null   object
 3   Sub_Category             1000 non-null   object
 4   Product_Line             1000 non-null   object
 5   Price_Tier               1000 non-null   object
 6   Units_Sold               1000 non-null   int64
 7   Revenue_USD              1000 non-null   int64
 8   Online_Sales_Percentage  1000 non-null   int64
 9   Retail_Price             1000 non-null   int64
dtypes: int64(4), object(6)
memory usage: 78.3+ KB

In [8]:
from sklearn.preprocessing import LabelEncoder
pi = LabelEncoder()
dados['Month'] = pi.fit_transform(dados['Month'])
dados['Region'] = pi.fit_transform(dados['Region'])
dados['Main_Category'] = pi.fit_transform(dados['Main_Category'])
dados['Sub_Category'] = pi.fit_transform(dados['Sub_Category'])
dados['Product_Line'] = pi.fit_transform(dados['Product_Line'])
dados['Price_Tier'] = pi.fit_transform(dados['Price_Tier'])

In [9]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Month                    1000 non-null   int32
 1   Region                   1000 non-null   int32
 2   Main_Category            1000 non-null   int32
 3   Sub_Category             1000 non-null   int32
 4   Product_Line             1000 non-null   int32
 5   Price_Tier               1000 non-null   int32
 6   Units_Sold               1000 non-null   int64
 7   Revenue_USD              1000 non-null   int64
 8   Online_Sales_Percentage  1000 non-null   int64
 9   Retail_Price             1000 non-null   int64
dtypes: int32(6), int64(4)
memory usage: 54.8 KB

In [1]:
import pandas as pd
dados2 = pd.read_csv('C:/Users/Andre/Documents/DidaticaTech/atletas.csv')
dados2.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [2]:
faltantes = (dados2.isnull().sum() / len(dados2['ID']))*100
faltantes

ID         0.000000
Name       0.000000
Sex        0.000000
Age        3.494445
Height    22.193821
Weight    23.191180
Team       0.000000
NOC        0.000000
Games      0.000000
Year       0.000000
Season     0.000000
City       0.000000
Sport      0.000000
Event      0.000000
Medal     85.326207
dtype: float64

In [10]:
dados2['Age'].fillna(dados2['Age'].mean())
dados2['Height'].fillna(dados2['Height'].mean())
dados2['Weight'].fillna(dados2['Weight'].mean())
dados2['Medal'].fillna('nenhuma')
dados2.head(100)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.00000,80.000000,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.00000,60.000000,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,175.33897,70.702393,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,175.33897,70.702393,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.00000,82.000000,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,32,Olav Augunson Aarnes,M,23.0,175.33897,70.702393,Norway,NOR,1912 Summer,1912,Summer,Stockholm,Athletics,Athletics Men's High Jump,NaN
96,33,Mika Lauri Aarnikka,M,24.0,187.00000,76.000000,Finland,FIN,1992 Summer,1992,Summer,Barcelona,Sailing,Sailing Men's Two Person Dinghy,NaN
97,33,Mika Lauri Aarnikka,M,28.0,187.00000,76.000000,Finland,FIN,1996 Summer,1996,Summer,Atlanta,Sailing,Sailing Men's Two Person Dinghy,NaN
98,34,Jamale (Djamel-) Aarrass (Ahrass-),M,30.0,187.00000,76.000000,France,FRA,2012 Summer,2012,Summer,London,Athletics,"Athletics Men's 1,500 metres",NaN
99,35,Dagfinn Sverre Aarskog,M,24.0,190.00000,98.000000,Norway,NOR,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN

In [28]:
import pandas as pd
dados3 = pd.read_csv('C:/Users/Andre/Documents/DidaticaTech/adesivo_teste.csv')
dados4 = pd.read_csv('C:/Users/Andre/Documents/DidaticaTech/adesivo_treino.csv')
pd.set_option('display.max_columns',42)

In [29]:
dados4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 230130 entries, 0 to 230129
Data columns (total 6 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   id        230130 non-null  int64
 1   date      230130 non-null  object
 2   country   230130 non-null  object
 3   store     230130 non-null  object
 4   product   230130 non-null  object
 5   num_sold  221259 non-null  float64
dtypes: float64(1), int64(1), object(4)
memory usage: 10.5+ MB

In [36]:
from sklearn.preprocessing import LabelEncoder
pi = LabelEncoder()
dados4['date'] = pi.fit_transform(dados4['date'])
dados4['country'] = pi.fit_transform(dados4['country'])
dados4['store'] = pi.fit_transform(dados4['store'])
dados4['product'] = pi.fit_transform(dados4['product'])

In [45]:
c = dados4['num_sold'].fillna(dados4['num_sold'].mean(), inplace = True)
c

In [46]:
dados4.head(100)

    id  date  country  store  product     num_sold
0    0     0        0      0        0   752.527382
1    1     0        0      0        1   973.000000
2    2     0        0      0        2   906.000000
3    3     0        0      0        3   423.000000
4    4     0        0      0        4   491.000000
..  ..   ...      ...    ...      ...          ...
95  95     1        0      2        0   281.000000
96  96     1        0      2        1  1972.000000
97  97     1        0      2        2  1541.000000
98  98     1        0      2        3   783.000000
99  99     1        0      2        4  1068.000000

[100 rows x 6 columns]

In [47]:
from sklearn.linear_model import LinearRegression
x = dados4.drop('num_sold', axis=1)
y = dados4['num_sold']

from sklearn.model_selection import train_test_split as tts
x_treino, x_teste, y_treino, y_teste = tts(x,y, test_size=0.3, random_state=10)
modelo = LinearRegression()
modelo.fit(x_treino, y_treino)
resultado = modelo.score(x_teste, y_teste)
print(resultado)

0.12747639025065582